{
  "name": "Samuel Ronick",
  "aboutMe": "I’m Samuel Ronick, a seasoned AI and web development consultant with over 5 years of experience helping businesses unlock the full potential of their digital platforms. Whether you're running a SaaS business, an e-commerce store, or a service-based company, I specialize in improving existing platforms by integrating cutting-edge features and optimizing performance. I started my career as a full-stack developer, building high-performance web applications and gradually shifted my focus to AI-powered solutions and platform enhancements. My goal is to make your platform smarter, faster, and more efficient—helping you stay ahead in a competitive market without the overhead of hiring an internal development team.",
  "blogs": [
    {
      "title": "Deploy Express App as AWS Lambda Container with API Gateway using Terraform",
      "description": "This tutorial provides a step-by-step guide to containerizing your application, deploying it to AWS Elastic Container Registry (ECR), creating a Lambda function from the container image, and connecting it to API Gateway, all using Terraform for efficiency and simplicity.",
      "date": "",
      "link": "https://dev.to/samuelronick/deploy-express-app-as-aws-lambda-container-with-api-gateway-using-terraform-35k3"
    },
    {
      "title": "Step-by-Step Guide: How to Set Up Meta WhatsApp API to Manage WhatsApp Business Accounts (WABA) - Part One",
      "description": "Step-by-Step Guide: How to Set Up Meta WhatsApp API to Manage WhatsApp Business Accounts (WABA)",
      "link": "https://www.linkedin.com/pulse/step-by-step-guide-how-set-up-meta-whatsapp-api-manage-samuel-ronick-w6gvf/?trackingId=iccffnNqRamT0PiKw1cbrA%3D%3D"
    },
    {
      "title": "Step-by-Step Guide: How to Set Up Meta WhatsApp API to Manage WhatsApp Business Accounts (WABA) - Part Two",
      "description": "In Part Two of this tutorial, you'll learn how to onboard WhatsApp Business Accounts (WABA), set up webhooks to receive events, and explore additional WhatsApp endpoints for various business applications, following the \"Get Started for Tech Providers\" or \"Get Started for Solution Partners\" guides.",
      "date": "",
      "link": "https://www.linkedin.com/pulse/step-by-step-guide-how-set-up-meta-whatsapp-api-manage-samuel-ronick-mgeaf/?trackingId=eK4mP7wPT%2BCGOJtASzu5YA%3D%3D"
    },
    {
      "title": "A Comprehensive Guide to Software Testing Principles and Strategies",
      "description": "This article addresses common questions about software testing, highlighting its importance in the development process for both startups and large enterprises. It emphasizes how effective testing contributes to enhancing software quality, reliability, and robustness.",
      "date": "",
      "link": "https://medium.com/@ronicksamuel/a-comprehensive-guide-to-software-testing-principles-and-strategies-9f1efed8cda3"
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Kindroom - A Skill-Based Approach to Affordable Housing",
      "role": "Full Stack Web Developer",
      "link": "https://kindroom.com",
      "technologies": [
        "GraphQL",
        "Firebase",
        "Auth",
        "MongoDB",
        "Stripe",
        "Recoil",
        "Next.js"
      ],
      "image": {
        "src": "kindroom-img.png",
        "alt": "kindroom project"
      },
      "thumbnail": "",
      "description": "Kindroom is a platform that allows tenants to exchange their skills for accommodation instead of paying traditional rent. My role involved building both the front-end and back-end, with a focus on performance optimization, security, and user experience.",
      "contributions": [
        {
          "heading": "Back-end Highlights:",
          "contributions": [
            "Developed a GraphQL API server that improved response times by 30%.",
            "Implemented authentication and role-based authorization using Firebase Auth for secure access control.",
            "Integrated a comprehensive Stripe payment system for smooth transaction handling, covering payment methods and subscription schedules.",
            "Designed efficient MongoDB connections and data models with Mongoose for managing room data.",
            "Built a data filtering and query system using MongoDB operators and aggregations, allowing users to search and filter rooms based on various criteria."
          ]
        },
        {
          "heading": "Front-end Highlights:",
          "contributions": [
            "Connected the front-end with the GraphQL API for real-time data fetching.",
            "Utilized Next.js server-side rendering for better SEO and improved page performance.",
            "Managed state efficiently using Recoil and React, enhancing the user experience.",
            "Implemented lazy loading and code splitting techniques to optimize the page load time and reduce bundle size.",
            "Ensured robust security by integrating Firebase to manage and secure user sessions."
          ]
        }
      ],
      "summary": "The project was a collaborative effort, ensuring alignment with business requirements while maintaining a high level of user experience."
    },
    {
      "id": 2,
      "title": "Amaziri – AI-Powered Business Assistant for Social Media Automation",
      "role": "Full Stack Web Developer",
      "link": "https://github.com/sammy0055",
      "technologies": [
        "Node.js",
        "GraphQL",
        "AWS Serverless",
        "Terraform",
        "Docker",
        "Firebase",
        "MongoDB",
        "Next.js",
        "Meta API (FACEBOOK, WHATSAPP (WABA), INSTAGRAM)"
      ],
      "image": {
        "src": "amaziri-img.png",
        "alt": "amaziri project"
      },
      "thumbnail": "",
      "description": "Amaziri is a smart business assistant designed to automate social media activities by leveraging business-specific data. I played a leading role in its development, focusing on key features that deliver impactful automation solutions for businesses",
      "contributions": [
        {
          "heading": "Highlights:",
          "contributions": [
            "Knowledge Base Development: Spearheaded the creation of a robust knowledge base feature using Retrieval-Augmented Generation (RAG) with OpenAI's embeddings model. Implemented MongoDB with vector support for efficient data storage and retrieval, alongside AWS S3 for document storage, enabling seamless access to business insights.",
            "AI Assistant Feature: Led the development of an AI-powered assistant that combines the knowledge base's RAG capabilities with a large language model (LLM). This feature automates content creation and customer interactions, tailored to each business's specific needs.",
            "Custom Branding Integration: Implemented a system allowing users to customize AI-generated content based on their unique brand voice, ensuring that the output aligns with their writing style and tone for consistent branding across platforms.",
            "Meta API Integration: Directed the integration of Meta APIs for Facebook, Instagram, and WhatsApp Business (WABA). This enables users to automate and manage social media interactions across these major platforms efficiently.",
            "Modular Workflow Automation: Developed a modular workflow automation engine where users can design and execute automated workflows. This allows businesses to streamline tasks based on their specific requirements, significantly improving productivity and reducing manual effort.",
            "Cloud Deployment Orchestration: Led the orchestration of cloud deployments to AWS services, including Lambda, ECR, and API Gateway, using Docker and Terraform. This ensures scalability, security, and seamless delivery of services to clients."
          ]
        }
      ],
      "summary": "Amaziri is a personal project, demonstrating my ability to independently lead and manage complex software development efforts. I ensured alignment with business needs while maintaining a focus on delivering an exceptional user experience."
    }
  ]
}
